'''
变量：
打印语句里是可以直接写数字和变量的
变量的作用：储存数据的（给数据起名字的）
如何写一个变量：10 10 10
    格式：变量名=数据
    注意：右边值赋值给左边
变量命名的规则：
    1.见名知意
    2.变量名可以使用字母、数字和下划线
    3.数字不可以开头
    4.区分大小写
    5.不能使用关键字
'''

'''
变量类型：
整数  小数
type（）：检测变量是什么类型的
整数int   小数float
字符串str：用双引号或者单引号就是字符串
布尔bool：用来判断对错的True正确    False错误
空值None：这个变量没有值
'''

'''
类型转换：
数字可以和数字直接运算
整数和字符串不能够运算
只有同类型的数据才能运算
字符串的加法运算：是拼接
整数和字符串做加法运算，除非字符串的内容是数字
我们可以将字符串转换为整数
转换方式：int（要转换的数据/变量）
将整数转换为字符串str（）
'''

'''
判断程序的过程:从上到下，从左到右依次执行
判断语句：if 判断条件：
                    满足条件后执行的代码块
当所有条件都不满足就执行else语句，else语句只能放在最后，可以不写
判断i语句必须是if开始
chr()字符 会将数字转换成对应的ASCCII
ASCII
a=97    b=98
A=65    B=66
'''

'''
1.算数运算符
加+
减-
乘*
除/
取整//不是四舍五入，直接舍弃小数部分
求余数（求模）%
a的b次方：**
2.赋值运算符：=
3.符合预算符：+=...
4.关系运算符：<   >   =   >=  <=  !=  ==
5.逻辑运算符：
    and：条件全部满足才是True，有False则False
    or：有Ture则Ture
    not：取反
'''